package com.example.esds2s.ApiClient.Controlls

import android.content.Context
import android.os.Build
import android.util.Log
import com.example.esds2s.Helpers.Enums.GenderType
import com.example.esds2s.Helpers.Helper
import com.example.esds2s.Helpers.ModelInfo
import com.example.esds2s.Interface.IGeminiServiceEventListener
import com.example.esds2s.Models.ResponseModels.GeminiResponse
import com.google.ai.client.generativeai.Chat
import com.google.ai.client.generativeai.GenerativeModel
import com.google.ai.client.generativeai.type.*
import com.google.gson.Gson
import kotlinx.coroutines.*
import okhttp3.FormBody
import okhttp3.OkHttpClient
import okhttp3.Request
import org.json.JSONObject
import java.lang.ref.Cleaner
import java.text.SimpleDateFormat
import java.time.format.TextStyle
import java.util.*
import java.time.ZonedDateTime;
import java.time.format.DateTimeFormatter
import java.util.concurrent.Semaphore

class ChatAIProvider(private  val context:Context) {

    companion object {

        fun filterTextFromSymbols(inputText: String): String {
            val filteredText = inputText.replace(Regex("[^\\p{L}\\p{N}]"), " ")
            val trimmedText = filteredText.replace(Regex("\\s+"), " ")
            return trimmedText
        }

        val hijriMonths = arrayOf(
            "محرم", "صفر", "ربيع الأول", "ربيع الآخر",
            "جمادى الأولى", "جمادى الآخرة", "رجب", "شعبان",
            "رمضان", "شوال", "ذو القعدة", "ذو الحجة"
        )

        val req = mapOf(
           "ar-SA" to "فقط يجب ان تكون الاجابة بشكل كامل بالعربي",
            "en-US" to "The answer must be in English",
            "fr-FR" to "فقط يجب ان تكون اجابتك بشكل كامل باللغة الفرنسية",
            "es-ES" to "يجب ان تكون اجابتك بشكل كامل باللغة الاسبانية فقط"
        )

        var docs = """
إكسبو 2030
ما هو؟

معرض دولي يقام في الرياض من 1 أكتوبر 2030 إلى 31 مارس 2031.

ما هو موضوعه؟

حقبة التغيير: معًا نستشرف المستقبل.

شركة نظم الرياض لتقنية المعلومات
ما هي؟

شركة سعودية متخصصة في مجال تقنية المعلومات.

متى تأسست؟

عام 2010.

كأس العالم 2034
من سيستضيفه؟

المملكة العربية السعودية.

مؤتمر ومعرض LEAP 2024 او ليب
ما هو؟

أكبر حدث تكنولوجي على مستوى العالم يركز على مستقبل التقنيات.

متى سيقام؟

من 4 إلى 7 مارس 202

ماهو وصيل ؟
وصيل (Waseel) هو تطبيق أو خدمة تكنولوجيا المعلومات يهدف إلى تقديم المساعدة وتوفير المعلومات باللغة العربية. يعتبر وصيل نموذجًا أوليًا لريبوت (Bot) سعودي التطوير، حيث يتم تطويره بواسطة شركة نظم الرياض لتقنية المعلومات.
الهدف من وصيل هو توفير رعاية صحية استثنائية للمرضى، وضمان راحتهم وتعزيز رفاهيتهم بشكل عام. يتكامل وصيل مع السياق والثقافة المحلية، ويستفيد من خبرة مطوريه في المملكة العربية السعودية لتقديم منتجات وخدمات عالية الجودة.
وفقًا للنص الذي قدمته، يُظهر أن وصيل يعتبر نموذجًا أوليًا لريبوت يقدم معلومات حول نفسه، أهدافه، والخدمات التي يقدمها.

""".trimIndent()


        val timeRelatedWords = listOf(
            "الوقت",
            "التاريخ",
            "اليوم",
            "السنة",
            "الشهر",
            "الساعة",
            "الدقيقة",
            "الثانية",
            "الصباح",
            "المساء",
            "الليل"
        )
        val timeRelatedPhrases = listOf(
            "ما هو الوقت",
            "ما هو التاريخ",
            "ما هو يوم الأسبوع",
            "ما هو الشهر",
            "ما هي السنة",
            "ما هي الساعة",
            "ما هي الدقيقة",
            "ما هي الثانية",
            "كم الساعة الآن",
            "كم الوقت الآن",
            "كم التاريخ الآن"
        )
        val formatter = SimpleDateFormat("HH:mm:ss")
        var model: GenerativeModel? = null
            private set
    }
//    data class Content(
//        val role: String,
//        val parts: List<Any> // استخدم Any لأن الجزء قد يحتوي على أنواع بيانات مختلفة
//    )
        var chat: Chat? = null // تصحيح الخطأ الطباعي وتعريف النوع

        

    
    init {
        initializeModel()
        getTime()
//        runBlocking {
//            load()
//        }

    }




    fun smartAnswerYesNo(userInput: String): Boolean {
        val lowerInput = userInput.lowercase()

        if (timeRelatedWords.any { lowerInput.contains(it) } || timeRelatedPhrases.any { lowerInput.contains(it) }) {
            return true
        }

        // نظرًا لعدم وجود مكتبة مطابقة ضبابية مباشرة في Kotlin، يمكننا تجاهل هذا الجزء أو تنفيذ منطق بسيط للمطابقة
        // لتبسيط الأمور، سنتجاهل البحث الضبابي هنا

        return false
    }

    fun getReqDate(text: String): String {
        if (!smartAnswerYesNo(text)) return ""
        val formattedDateTime =  getCurrentDateTime()
        return "$formattedDateTime هذا هو التاريخ الحالي والوقت واليوم لا تذكره الا عندما يطلبة منك المستخدم "
    }
    val simaphor = Semaphore(1)
   var indexRequest=-1
    var    isbisy=false
    fun getTime(){
        try {
             GlobalScope.async {
                isbisy=true
                val response = SessionChatControl(context).getTime()
                if (response != null) {
                    valueCurrentDateAll = response.description
                }
                isbisy=false
            }
        }catch (E:Exception){ }
        finally { }
    }
    var valueCurrentDateAll=""
    fun getCurrentDateTime(): String {
        // أسماء الأشهر الهجرية
        val currentDate:String
//        val hijrahChronology = HijrahChronology.INSTANCE
        // التاريخ الميلادي
        indexRequest%=10
        if(indexRequest==0) {
            getTime()
//            simaphor.acquire()
        }

        val time = Calendar.getInstance().time
         currentDate = formatter.format(time)?.toString()!!
        indexRequest++

        return  valueCurrentDateAll+" ( الوقت الحالي هو :"+ currentDate +"("
    }
    private fun initializeModel() {
        model = GenerativeModel(
           "gemini-1.0-pro-001",
//            "gemini-1.0-pro",
            "AIzaSyDW35bfhBIy28pH39-vcKOGFRKNd2eo1NU",
            generationConfig = generationConfig {
                temperature = 0.9f
                topK = 1
                topP = 1f
                maxOutputTokens = 256

                stopSequences = listOf(
                    "السياسة ",
                    "الازدواجية",
                    "الحروب",
                    "حقوق الانسان ",
                    "الجانب العسكري",
                    " السكس",
                    " الاباحية",
                )
            },
            safetySettings = listOf(
                SafetySetting(HarmCategory.HARASSMENT, BlockThreshold.MEDIUM_AND_ABOVE),
                SafetySetting(HarmCategory.HATE_SPEECH, BlockThreshold.MEDIUM_AND_ABOVE),
                SafetySetting(HarmCategory.SEXUALLY_EXPLICIT, BlockThreshold.ONLY_HIGH),
                SafetySetting(HarmCategory.DANGEROUS_CONTENT, BlockThreshold.MEDIUM_AND_ABOVE),
            )
        )
    }

    suspend fun load() {

       counterErrors=0
        val mdelInfo=ModelInfo(context!!)
        val name = mdelInfo?.getInfo()?.scope!!
        val gender = if(mdelInfo?.getGender()==GenderType.MALE) "ذكر" else "انثئ"

        data class FAQ(val question: String, val answer: String)

//        val faqs = listOf(
//
//            FAQ(
//                question = "كيف استطيع التسجيل في البوابة للاستفادة من الخدمات الالكترونية؟",
//                answer = "اتاحت الوزارة امكانية التسجيل في بوابة الوزارة من خلال بوابة النفاذ الموحد لجميع الخدمات والمنصات الالكترونية و بالتكامل مع النفاذ الوطني 'ابشر'. دليل المستخدم (هنا) فيديو تعريفي (هنا)"
//            ),
//            FAQ(
//                question = "هل يتم الاستفادة من التعليقات والتقييمات التي يتم ارسالها من قبل الوزارة؟",
//                answer = "قامت الوزارة باتاحة مؤشرات رقمية لمتابعة تقييم محتوى البوابة والخدمات بشكل مستمر و آلي وتم نشر نتيجة التقييم على البوابة, وقامت الوزارة بتخصيص فريق لمراجعة أقل الصفحات والخدمات تقييما واعادة تحسينها لرفع جودتها. مؤشرات البوابة (هنا)"
//            ),
//            FAQ(
//                question = "هل استطيع كقطاع اعمال الاستفادة من الخدمات الالكترونية التي تقدمها الوزارة؟",
//                answer = "الوزارة تتيح خدمات الكترونية لجميع انواع المستفيدين وتستطيع التسجيل باستخدام رقم السجل التجاري وسوف يتم التحقق واسترجاع بيانات الشركة من بيانات وزارة التجارة والاستثمار"
//            ),
//            FAQ(
//                question = "هل استطيع معاينة الطلب بشكل نهائي قبل ارساله؟",
//                answer = "توفر جميع منصات الوزارة القدرة على معاينة واستعراض بيانات الطلب قبل الارسال النهائي وذلك لتمكين المستفيد من مراجعة البيانات والتأكد منها قبل ارسال الطلب"
//            ),
//            FAQ(
//                question = "هل استطيع حفظ الطلب وارساله في وقت لاحق؟",
//                answer = "توفر جميع منصات الوزارة القدرة على حفظ الطلب كمسودة وإعادة إرساله وقت الحاجة"
//            ),
//            FAQ(
//                question = "هل يتطلب مني إعادة ادخال البيانات عند ارسال كل طلب؟",
//                answer = "لا تتطلب المنصات لدى الوزارة إعادة ادخال البيانات للمستفيدين ويتم التحقق واسترجاع البيانات من الجهات الحكومية ذات العلاقة."
//            ),
//            FAQ(
//                question = "ماهي البيانات الشخصية المطلوبة في التسجيل في المنصات الالكترونية؟",
//                answer = "لا تتطلب المنصات التابعة للوزارة ادخال البيانات الشخصية وانما سوف يتم استرجاعها من منصة 'أبشر'."
//            ),
//            FAQ(
//                question = "ماهو الوضع الصحي الوبائي لاستيراد الخيول إلى المملكة؟",
//                answer = "يتم استيراد الخيل إلى المملكة وفق الوضع الصحي الوبائي لكل دولة، وتختلف الدول المسموح بها ويمكن الرجوع لها من خلال البوابة الإلكترونية الخاصة بالوزارة \"نما\"."
//            ),
//            FAQ(
//                question = "من يقوم بإصدار شهادة صحية لتصدير الخيول؟",
//                answer = "يتم الكشف على الخيل المراد تصديرها بعد سحب العينات اللازمة وتحليلها، ومن ثم يتم إصدار الشهادات الصحية اللازمة من قبل المحجر الدولي للخيل بالجنادرية."
//            ),
//            FAQ(
//                question = "ماهي شروط الحصول على إذن استيراد الحيوانات والطيور وبيض التفقيس؟",
//                answer = "- يسمح الحصول على إذن استيراد للحيوانات الحية \"المواشي الحية\" دون رسوم مالية وفق الضوابط المحددة. يجب تقديم الطلب على المنصة الإلكترونية \"نما\" وإرفاق الوثائق المطلوبة مثل السجل التجاري، والإيجار إذا كان الاستيراد للأفراد، وفاتورة التحصينات."
//            ),
//            FAQ(
//                question = "ماهي الدول المسموح استيراد الخيول منها للملكة؟",
//                answer = "يتم الاستيراد فقط من دول معتمدة أو من مناطق في دول معتمدة من قبل الوزارة منها (الولايات المتحدة الأمريكية وكندا والاتحاد الأوربي وأستراليا ونيوزيلندا والإمارات وقطر وعمان واليابان وبعض من دول أسيا) والتي ينبغي مراجعة الوزارة (المحجر الدولي للخيل بالجنادرية) لمعرفة العديد من الدول قبل إجراء أي ترتيب لاستيراد الخيل ويسمح فقط باستيراد الخيل المسجلة (جواز سفر أو وثيقة تسجيل رسمية)."
//        ),
//            FAQ(
//                question = "في حالة الشك بوجود تسمم بالرصاص أو أي مشكلة في جودة المياه، كيف يمكن فحص المياه والتأكد؟",
//                answer = "في حالة الاشتباه بوجود تسمم أو أي مشكلة في جودة المياه، يجب على العميل في المدن (الرياض، جده، الطائف، وجدة) زيارة مختبر شركة المياه الوطنية لفحص العينة. أما إذا كان العميل في غير المدن المذكورة، فيجب عليه التوجه لمختبر أقرب مديرية مياه أو أحد فروعها."
//            ),
//            FAQ(
//                question = "كيف يتم حساب المياه الغير محلاة وأنا ساكن في ضاحية الملك فهد بالدمام؟",
//                answer = "بناءً على موافقة معالي الوزير بتاريخ 12/02/1438هـ، إذا كانت المياه صالحة للشرب، فإن فاتورة المياه الشهرية تساوي الكمية الكلية للمياه بالتعرفة الجديدة. أما إذا كانت المياه غير صالحة للشرب، فإن الفاتورة الشهرية تساوي نصف الكمية الكلية للمياه بالتعرفة الجديدة."
//            ),
//            FAQ(
//                question = "ماهي شروط الغابات التي لايجوز استثمارها إلا بترخيص من وزارة الزراعة؟",
//                answer = "- الغابات التي تزيد فيها نسبة ميل الأرض عن 40%. - الغابات التي يستفاد منها في منع زحف الرمال أو تثبيتها. - الغابات التي تحافظ على مجاري المياه أو المخزون المائي. - الغابات التي تحمي أشجارها بعض الأراضي من اجتياح السيول. - الغابات التي تكون أحزمة خضراء حول المدن والقرى بتجميلها أو لتلطيف مناخها."
//            ),
//            FAQ(
//                question = "ماهي شهادة السجل الزراعي؟",
//                answer = "هي مستند رسمي يصدر من وزارة الزراعة لكل شاغل موقع زراعي بعد أن يستوفي متطلبات منح هذا المستند."
//            )   ,
//            FAQ(
//                question = "ما هو السجل الزراعي؟",
//                answer = "السجل الزراعي عبارة عن التوثيق الوصفي والبياني للنشاط أو الأنشطة الزراعية التي يقوم بها شاغل الموقع الزراعي"
//            )
//        )

//        var history = listOf(
//
//            content("user") {
//                text("ماهو اسمك ؟ ")
//            },
//            content("model") {
//                text( name?:"فهد")//scop
//            },
//            content("user") {
//                text("الاحداث الجديدة خذها في الاعتبار اذا تم سؤالك فقط ولا تذكرها ابدا ")
//            },
//            content("model") {
//                text(docs)//scop
//            },
//            content("user") {
//                text("عرفني عن نفسك  ")
//            },
//            content("model") {
//                text("مرحبا  اسمي  هو  $name    وانا   نموذج اولي  لريبوت  سعودي التطوير    كمتحدث   $gender\n" +
//                        "تم تطويري  بواسطة شركة نظم الرياض    لتقنية المعلومات \n" +
//                        " قيد التطوير في المملكة العربية السعودية. هدفي هو أن أكون مصدرًا للمعلومات والمساعدة باللغة العربية، وأن أكون قادرًا على إجراء محادثات طبيعية وفهم السياق. مازلت في مرحلة التطوير، ولدي الكثير لأتعلمه. أقدر ملاحظاتك واستفساراتك التي تساعدني على التحسين المستمر")//scop
//            },
//        )
//        val waseelFAQs: List<FAQ> = listOf(
//
//            FAQ(
//                question = "ما هو وصيل؟",
//                answer = "وصيل (Waseel) هو تطبيق أو خدمة تكنولوجيا المعلومات يهدف إلى تقديم المساعدة وتوفير المعلومات باللغة العربية."
//            ),
//            FAQ(
//                question = "ماهي العلامة التجارية لوصيل؟",
//                answer = "العلامة التجارية لوصيل هي أكثر من مجرد فكرة على الورق. الغرض والوحدة: تمكين التكنولوجيا من الارتقاء بالنظام البيئي للرعاية الصحية من أجل البشرية الأفضل."
//            ),
//            FAQ(
//                question = "قيم المرضى لدى وصيل؟",
//                answer = "في قلب مهمتنا يوجد التزام عميق بتوفير رعاية استثنائية لمرضانا، وضمان راحتهم وتعزيز رفاهيتهم بشكل عام."
//            ),
//            FAQ(
//                question = "مع من تتكيف وصيل؟",
//                answer = "نحن نتكيف مع السياق والثقافة المحلية، ونستفيد من خبرتنا في المنطقة لتقديم منتجات وخدمات عالية الجودة مصممة خصيصًا لتلبية احتياجات عملائنا."
//            ),
//            FAQ(
//                question = "ماذا تعزز وصيل؟",
//                answer = "نتبنى أفكارًا وفرصًا جديدة للنمو والتحسين. نحن نقدم التميز باستمرار، ونذهب إلى أبعد الحدود لضمان الإنجاز."
//            ),
//            FAQ(
//                question = "على ماذا يسلط شعار وصيل الضوء؟",
//                answer = "يسلط شعار وصيل الضوء على قيم العمل ويستحضر صورة العلامة التجارية."
//            ),
//            FAQ(
//                question = "ماهي ركائز وصيل؟",
//                answer = "الشركاء، ومقدمو الخدمات، والدافعون، والمرضى."
//            ),
//            FAQ(
//                question = "ماذا عن شعار منتجات وصيل؟",
//                answer = "تم تصميم شعارات منتجات وصيل ضمن نفس بنية الشعار الأساسي عن طريق إضافة اسم المنتج؛ وقد تم تمييز كل منتج بلون معين ليمثل مميزاته والجمهور المستهدف."
//            ),
//            FAQ(
//                question = "ماذا عن الطباعة في وصيل؟",
//                answer = "تلعب الطباعة دورًا حيويًا في التعبير عن شخصية علامتنا التجارية وكذلك في إيصال رسالتنا بكل تعقيد ووضوح."
//            ),
//            FAQ(
//                question = "من يقوم بتطوير وصيل؟",
//                answer = "وصيل يتم تطويره بواسطة شركة نظم الرياض لتقنية المعلومات في المملكة العربية السعودية."
//            ),
//            FAQ(
//                question = "ما هو هدف وصيل؟",
//                answer = "هدف وصيل هو توفير رعاية صحية استثنائية للمرضى، وضمان راحتهم وتعزيز رفاهيتهم بشكل عام."
//            ),
//            FAQ(
//                question = "كيف يعمل وصيل؟",
//                answer = "يستخدم وصيل التكنولوجيا لتحسين تجربة المستخدم وتسهيل الوصول إلى المعلومات الصحية. يمكن للمستخدمين طرح أسئلتهم والحصول على إجابات من وصيل."
//            ),
//            FAQ(
//                question = "هل يتوفر وصيل في جميع المناطق؟",
//                answer = "نعم، يهدف وصيل إلى توفير خدماته في جميع أنحاء المملكة العربية السعودية. ومع ذلك، قد تختلف بعض الخدمات باختلاف المناطق."
//            ),
//            FAQ(
//                question = "هل يتطلب وصيل رسومًا؟",
//                answer = "الاستخدام الأساسي لوصيل عادة ما يكون مجانيًا، ولكن قد تكون هناك رسوم لبعض الخدمات الإضافية. يفضل التحقق من التفاصيل الدقيقة من التطبيق أو الموقع الرسمي."
//            ),
//            FAQ(
//                question = "ما هي اللغات المدعومة في وصيل؟",
//                answer = "وصيل يدعم اللغة العربية كلغة رئيسية، ولكن قد يتم دعم لغات إضافية حسب التحديثات والاحتياجات."
//            ),
//            FAQ(
//                question = "كيف يمكنني التواصل مع فريق وصيل؟",
//                answer = "يمكنك التواصل مع فريق وصيل من خلال قسم الدعم في التطبيق أو الموقع الرسمي. يتم تقديم الدعم لحل أي استفسارات أو مشاكل قد تواجهها."
//            ),
//            FAQ(
//                question = "ما هي التقنيات المستخدمة في وصيل؟",
//                answer = "وصيل يستخدم تقنيات حديثة في مجال تكنولوجيا المعلومات، بما في ذلك الذكاء الاصطناعي وتحليل البيانات، لتحسين تجربة المستخدم وجعل الخدمات أكثر كفاءة."
//            ),
//            FAQ(
//                question = "هل يتم توفير خدمات الطوارئ في وصيل؟",
//                answer = "نعم، قد يتم توفير خدمات الطوارئ في وصيل. يرجى التحقق من التفاصيل في التطبيق أو الموقع لمعرفة المزيد حول الخدمات المتاحة."
//            ),
//
//        )
//        for (faq in faqs) {
//
//            history.plus(content("user") {
//                text( faq.question)
//            })
//            history.plus(content("model") {
//                text( faq.answer)
//            })
//        }
//        for (faq in waseelFAQs) {
//
//            history.plus(content("user") {
//                text( faq.question)
//            })
//            history.plus(content("model") {
//                text( faq.answer)
//            })
//        }

        val chatHistory = listOf(

            content("user") {
                text("ماهو اسمك ؟ ")
            },
            content("model") {
                text( name)//scop
            },
            content("user") {
                text("الاحداث الجديدة خذها في الاعتبار اذا تم سؤالك فقط ولا تذكرها ابدا ")
            },
            content("model") {
                text(docs)//scop
            },
            content("user") {
                text("عرفني عن نفسك ")
            },
            content("model") {
                text("مرحبا  اسمي  هو  $name    وانا   نموذج اولي  لريبوت  سعودي التطوير    كمتحدث   $gender\n" +
                        "تم تطويري  بواسطة شركة نظم الرياض    لتقنية المعلومات \n" +
                        " قيد التطوير في المملكة العربية السعودية. هدفي هو أن أكون مصدرًا للمعلومات والمساعدة باللغة العربية، وأن أكون قادرًا على إجراء محادثات طبيعية وفهم السياق. مازلت في مرحلة التطوير، ولدي الكثير لأتعلمه. أقدر ملاحظاتك واستفساراتك التي تساعدني على التحسين المستمر")//scop
            },
            content("user") {
                text("يتم استيراد الخيل إلى المملكة وفق الوضع الصحي الوبائي لكل دولة،وتختلف الدول من حين إلى آخر، حيث يسمح االستيراد من عدة دوليمكن الرجوع لها من خالل البوابة اإللكترونية الخاصة بالوزارة \"نما\"ماهي الدول المسموح استيراد الخيل منها للمملكة؟ماهي الجهة المسؤولة عن إصدار شهادة صحية لتصديرالخيول؟يتم الكشف على الخيل المراد تصديرها بعد سحب العينات الالزمة منهاوتحليلها، ومن ثم إصدار الشهادات الصحية الالزمة من قبل \"المحجرالدولي للخيل بالجنادرية\".ماهي الدول المسموح استيراد الخيول منها للمملكة؟يتم االستيراد فقط من دول معتمدة أو من مناطق في دول معتمدة منقبل الوزارة منها )الواليات المتحدة األمريكية وكندا واالتحاد األوربيوأستراليا ونيوزيلندا واإلمارات وقطر وعمان واليابان وبعض من دول أسيا(والتي ينبغي مراجعة الوزارة )المحجر الدولي للخيل بالجنادرية( لمعرفةالعديد من الدول قبل إجراء أي ترتيب الستيراد الخيل ويسمح فقطباستيراد الخيل المسجلة )جواز سفر أو وثيقة تسجيل رسمية(.ما هي الجهة المسؤولة عن إصدار شهادة صحية لتصديرالخيول؟الجهة المسؤولة عن إصدار شهادة صحية هي إدارة المحجر الدوليللخيل بالجنادرية.نموذج عن المملكة العربية السعودية- يسمح الحصول على إذن استيراد للحيوانات الحية \"المواشي الحية\"، دونأي رسوم مالية وفق الضوابط التالية: • التقديم على المنصة اإللكترونيةالخاصة بالوزارة \"نما\". • إرفاق نسخة من السجل التجاري مضاف إليه نشاطمالئم لنوع اإلذن المطلوب )الشركات والمؤسسات فقط(، أو نسخة منالهوية الوطنية لألفراد. • إرفاق ما يثبت وجود مكان مـناسب إليواءالحيوانات الحية \"المواشي\" المستوردة )صك ملكية، عقد إيجار( لألفرادوالمؤسسات والمشاريع، على أن يكون عقد اإليجار مرتبط بتاريخ سريانالسجل التجاري. • إرفاق فاتورة من التحصينات المطلوبة؛ لتحصينالحيوانات المراد استيرادها، قبل الحصول على إذن االستيراد. • في حالاالستيراد من دول الخليج واألردن؛ يجب إرفاق نسخة من ترخيص مشروعإنتاج المواشي الحية من البلد المصدر. • يحق لألفراد استيراد المواشيالحية بعدد )100( رأس للضأن والماعز، أو )15( رأس لألبقار، أو )15( رأسلإلبل خالل السنة الواحدة. - يسمح الحصول على إذن استيراد الطيورالحية دون أي رسوم مالية وفق الضوابط التالية: • التقديم على المنصةاإللكترونية الخاصة بالوزارة \"نما\". • إرفاق نسخة من السجل التجاري مضافإليه نشاط مالئم لنوع اإلذن المطلوب )الشركات والمؤسسات فقط(، أونسخة من الهوية الوطنية، أو جواز السفر، او اإلقامة لألفراد. • فيما يخصاستيراد الطيور بشكل تجاري؛ فيجب الحصول على ترخيص \"مركز استيرادوتوزيع الطيور الحية\"، وإرفاق نسخة منه. • يحق لألفراد استيراد عدد )٦(طيور صغيرة، أو )٣( طيور كبيرة، كل )٦( أشهر. - يسمح الحصول على إذناستيراد بيض التفقيس والصيصان والمنتجات الحيوانية غير المصنعة)للشركات والمؤسسات فقط(، دون أي رسوم مالية وفق الضوابط التالية:• التقديم على المنصة اإللكترونية الخاصة بالوزارة \"نما\". • إرفاق نسخة منالسجل التجاري مضاف إليه نشاط مالئم لنوع اإلذن المطلوب. • فيما يخصاستيراد بيض التفقيس والصيصان فيجب إرفاق نسخة من ترخيص مشروعالدواجن.ماهي شروط الحصول على إذن استيراد الحيوانات الحيةوالطيور وبيض التفقيس والصيصان والمنتجات الحيوانية غيرالمصنعة من دون رسوم مالية؟كيف استطيع التسجيل في البوابة لالستفادة من الخدماتااللكترونية؟اتاحت الوزارة امكانية التسجيل في بوابة الوزارة من خالل بوابة النفاذالموحد لجميع الخدمات والمنصات االلكترونية و بالتكامل مع النفاذالوطني \"ابشر\".ل يتم االستفادة من التعليقات والتقييمات التي يتم ارسالهامن قبل زوار البوابة؟قامت الوزارة باتاحة مؤشرات رقمية لمتابعة تقييم محتوى البوابةوالخدمات بشكل مستمر و آلي وتم نشر نتيجة التقييم على البوابة,وقامت الوزارة بتخصيص فريق لمراجعة أقل الصفحات والخدمات تقييماواعادة تحسينها لرفع جودتها.هل استطيع كقطاع أعمال االستفاده من الخدماتااللكترونية التي تقدمها الوزارة؟الوزارة تتيح خدمات الكترونية لجميع انواع المستفيدين وتستطيعالتسجيل باستخدام رقم السجل التجاري وسوف يتم التحقق واسترجاعبيانات الشركة من بيانات وزارة التجارة واالستثمار.هل أستطيع معاينة الطلب بشكل نهائي قبل ارساله؟توفر جميع منصات الوزارة القدرة على معاينة واستعراض بيانات الطلبقبل االرسال النهائي وذلك لتمكين المستفيد من مراجعة البياناتوالتأكد منها قبل ارسال الطلب.هل أستطيع حفظ الطلب وارساله في وقت الحق؟توفر جميع منصات الوزارة القدرة على حفظ الطلب كمسودة وإعادةإرساله وقت الحاجة.هل يتطلب مني إعادة ادخال البيانات عند ارسال كل طلب؟ال تتطلب المنصات لدى الوزارة إعادة ادخال البيانات للمستفيدين ويتمالتحقق واسترجاع البيانات من الجهات الحكومية ذات العالقة.ما هي البيانات الشخصية المطلوبة في التسجيل فيالمنصات االلكترونية؟ال تتطلب المنصات التابعة للوزارة ادخال البيانات الشخصية وانما سوفيتم استرجاعها من منصة \"أبشر\".في حالة الشك بوجود تسمم بالرصاص أو أي مشكلة فيجودة المياه، كيف يمكن فحص المياه والتأكد؟في حالة االشتباه بوجود تسمم مهما يكن نوعه، فعلى العميل فيالمدن )الرياض، جده، الطائف، وجدة( بزيارة مختبر شركة المياه الوطنيةلفحص العينة، اما في حال كان العميل في غير المدن المذكورة فعليهبالتوجه لمختبر أقرب مديرية مياه أو أحد فروعها.كيف يتم حساب المياه الغير محالة وأنا ساكن في ضاحيةالملك فهد الدمام؟إشارة لموافقة معالي الوزير بتاريخ 12/02/1438هـ على عرض لجنة دراسةالفوترة رقم )338/1/1437( فإنه إذا كانت المياه صالحة للشرب فان فاتورةالمياه الشهرية تساوي الكمية الكلية للمياه بالتعرفة الجديدة، بينما إذاكانت المياه غير صالحة للشرب فإن الفاتورة الشهرية تساوي نصف الكميةالكلية للمياه بالتعرفة الجديدة.ما هي شهادة السجل الزراعي؟هي مستند رسمي يصدر من وزارة الزراعة لكل شاغل موقع زراعي بعد أنيستوفي متطلبات منح هذا المستند.ما هو السجل الزراعي؟السجل الزراعي عبارة عن التوثيق الوصفي والبياني للنشاط أو األنشطةالزراعية التي يقوم بها شاغل الموقع الزراعي.ما هي البيانات الشخصية المطلوبة في التسجيل فيالمنصات االلكترونية؟")
            },
            content("model") {
                text("*الدول المسموح استيراد الخيل منها للمملكة:\n\nالدول المعتمدة أو المناطق في الدول المعتمدة من قبل الوزارة، والتي تشمل:\n- الولايات المتحدة الأمريكية\n- كندا\n- الاتحاد الأوروبي\n- أستراليا\n- نيوزيلندا\n- الإمارات\n- قطر\n- عمان\n- اليابان\n- بعض دول آسيا (يجب مراجعة وزارة الزراعة لمعرفة القائمة الدقيقة)\n\nالجهة المسؤولة عن إصدار شهادة صحية لتصدير الخيول:*\n\nإدارة المحجر الدولي للخيل بالجنادرية.")
            },
            content("user") {
                text("ما هي الدول المسموح باستيراد الخيل منها إلى المملكة")
            },
            content("model") {
                text("الدول المسموح باستيراد الخيل منها إلى المملكة هي الدول المعتمدة أو المناطق في الدول المعتمدة من قبل وزارة الزراعة السعودية، والتي تشمل:\n\n* الولايات المتحدة الأمريكية\n* كندا\n* الاتحاد الأوروبي\n* أستراليا\n* نيوزيلندا\n* الإمارات\n* قطر\n* عمان\n* اليابان\n* بعض دول آسيا (يجب مراجعة وزارة الزراعة لمعرفة القائمة الدقيقة)")
            },
            content("user") {
                text("ما هي الجهة المسؤولة عن إصدار شهادة صحية لتصدير الخيول؟")
            },
            content("model") {
                text("الجهة المسؤولة عن إصدار شهادة صحية لتصدير الخيول في المملكة العربية السعودية هي:\n\n*إدارة المحجر الدولي للخيل بالجنادرية*\n\nوهي تتبع وزارة البيئة والمياه والزراعة.")
            },
            content("user") {
                text("ما هي شروط الحصول على إذن استيراد الحيوانات الحية والطيور وبيض التفقيس والصيصان والمنتجات الحيوانية غير المصنعة من دون رسوم مالية")
            },
            content("model") {
                text("*شروط الحصول على إذن استيراد الحيوانات الحية والطيور وبيض التفقيس والصيصان والمنتجات الحيوانية غير المصنعة دون رسوم مالية:\n\nالحيوانات الحية (المواشي):\n\n التقديم على المنصة الإلكترونية الخاصة بوزارة البيئة والمياه والزراعة \"نما\".\n* إرفاق نسخة من السجل التجاري مضافًا إليه نشاط مالئم لنوع الإذن المطلوب (للشركات والمؤسسات فقط).\n* إرفاق نسخة من الهوية الوطنية للأفراد.\n* إرفاق ما يثبت وجود مكان مناسب لإيواء الحيوانات الحية المستوردة (صك ملكية، عقد إيجار) للأفراد والمؤسسات والمشاريع، على أن يكون عقد الإيجار مرتبطًا بتاريخ سريان السجل التجاري.\n* إرفاق فاتورة من التحصينات المطلوبة لتطعيم الحيوانات المراد استيرادها، قبل الحصول على إذن الاستيراد.\n* في حال الاستيراد من دول الخليج والأردن، يجب إرفاق نسخة من ترخيص مشروع إنتاج المواشي الحية من البلد المصدر.\n* يحق للأفراد استيراد المواشي الحية بعدد 100 رأس للضأن والماعز، أو 15 رأسًا للأبقار، أو 15 رأسًا للإبل خلال السنة الواحدة.\n\n*الطيور الحية:\n\n التقديم على المنصة الإلكترونية الخاصة بوزارة البيئة والمياه والزراعة \"نما\".\n* إرفاق نسخة من السجل التجاري مضافًا إليه نشاط مالئم لنوع الإذن المطلوب (للشركات والمؤسسات فقط).\n* إرفاق نسخة من الهوية الوطنية أو جواز السفر أو الإقامة للأفراد.\n* فيما يخص استيراد الطيور بشكل تجاري، فيجب الحصول على ترخيص \"مركز استيراد وتوزيع الطيور الحية\" وإرفاق نسخة منه.\n* يحق للأفراد استيراد عدد 6 طيور صغيرة أو 3 طيور كبيرة، كل 6 أشهر.\n\n*استيراد بيض التفقيس والصيصان والمنتجات الحيوانية غير المصنعة (للشركات والمؤسسات فقط):\n\n التقديم على المنصة الإلكترونية الخاصة بوزارة البيئة والمياه والزراعة \"نما\".\n* إرفاق نسخة من السجل التجاري مضافًا إليه نشاط مالئم لنوع الإذن المطلوب.\n* فيما يخص استيراد بيض التفقيس والصيصان، يجب إرفاق نسخة من ترخيص مشروع الدواجن.")
            },
            content("user") {
                text("كيف يمكن التسجيل في البوابة الإلكترونية للاستفادة من الخدمات؟")
            },
            content("model") {
                text("*خطوات التسجيل في البوابة الإلكترونية لوزارة البيئة والمياه والزراعة للاستفادة من الخدمات:*\n\n1. زيارة بوابة النفاذ الوطني الموحد: https://www.nafaz.sa\n2. النقر على خيار \"تسجيل مستخدم جديد\".\n3. اختيار نوع المستخدم (فرد أو منشأة).\n4. ملء نموذج التسجيل بالبيانات المطلوبة.\n5. التحقق من صحة البيانات المدخلة.\n6. النقر على زر \"تسجيل\".\n7. بعد التسجيل، سيتم إرسال رسالة نصية تحتوي على اسم المستخدم وكلمة المرور إلى رقم الجوال المسجل.\n\nبمجرد الانتهاء من عملية التسجيل، يمكنك تسجيل الدخول إلى البوابة الإلكترونية باستخدام اسم المستخدم وكلمة المرور اللتين تم إرسالهما إليك، والبدء في الاستفادة من الخدمات الإلكترونية المتوفرة.")
            },
            content("user") {
                text("كيف يتم الاستفادة من التعليقات والتقييمات التي يتم إرسالها من قبل زوار البوابة؟")
            },
            content("model") {
                text("تستفيد وزارة البيئة والمياه والزراعة من التعليقات والتقييمات التي يتم إرسالها من قبل زوار البوابة الإلكترونية من خلال:\n\n* *متابعة تقييم محتوى البوابة والخدمات بشكل مستمر وآلي:* حيث يتم نشر نتيجة التقييم على البوابة بحيث يمكن للوزارة رصد آراء وملاحظات المستخدمين بشكل مباشر.\n* *مراجعة أقل الصفحات والخدمات تقييمًا وإعادة تحسينها لرفع جودتها:* حيث خصصت الوزارة فريقًا لمراجعة الصفحات والخدمات التي تحصل على تقييمات منخفضة، وإجراء التحسينات اللازمة لرفع مستوى رضا المستخدمين.\n\nبالإضافة إلى ذلك، تستخدم الوزارة التعليقات والتقييمات لتحديد مجالات التحسين في خدماتها الإلكترونية، وتحديد أولويات تطوير الخدمات الجديدة والمميزات التي تلبي احتياجات المستخدمين.\n\nوتشجع الوزارة المستخدمين على تقديم تعليقاتهم وتقييماتهم على البوابة الإلكترونية، حيث أن هذه الملاحظات تساعد الوزارة على تحسين جودة خدماتها وتقديم أفضل تجربة ممكنة للمستخدمين.")
            },
            content("user") {
                text("هل يمكن لقطاع الأعمال الاستفادة من الخدمات الإلكترونية التي تقدمها الوزارة؟")
            },
            content("model") {
                text("نعم، يمكن لقطاع الأعمال الاستفادة من الخدمات الإلكترونية التي تقدمها وزارة البيئة والمياه والزراعة. وتوفر الوزارة خدمات إلكترونية مخصصة لقطاع الأعمال، بما في ذلك:\n\n* التسجيل في بوابة المستثمر الإلكترونية: https://investor.mewa.gov.sa/\n* تقديم طلبات الحصول على تراخيص وتصاريح الاستثمار الزراعي والحيواني والسمكي إلكترونيًا.\n* متابعة حالة الطلبات المقدمة وإجراء المدفوعات اللازمة.\n* الحصول على المعلومات والبيانات المتعلقة بالاستثمار الزراعي والحيواني والسمكي في المملكة.\n* التواصل مع الوزارة والاستفسار عن الخدمات المقدمة.\n\nبالإضافة إلى ذلك، يمكن لقطاع الأعمال الاستفادة من الخدمات الإلكترونية العامة التي تقدمها الوزارة، مثل:\n\n* التقديم على فرص التوظيف المعلن عنها.\n* تقديم الشكاوى والمقترحات إلكترونيًا.\n* الوصول إلى قاعدة بيانات التشريعات والأنظمة المتعلقة بالقطاع الزراعي والبيئي.\n* متابعة أخبار الوزارة وإعلاناتها.\n\nوتعمل الوزارة على تطوير المزيد من الخدمات الإلكترونية لتسهيل ممارسة الأعمال التجارية في قطاع الزراعة والبيئة، بما يتماشى مع رؤية المملكة 2030.")
            },
            content("user") {
                text("هل يمكن معاينة الطلب بشكل نهائي قبل إرساله؟")
            },
            content("model") {
                text("نعم، توفر جميع منصات وزارة البيئة والمياه والزراعة القدرة على معاينة واستعراض بيانات الطلب قبل الإرسال النهائي. وذلك لتمكين المستفيد من مراجعة البيانات والتأكد منها قبل إرسال الطلب.\n\nعند الانتهاء من ملء نموذج الطلب، ستظهر لك صفحة معاينة تعرض ملخصًا للبيانات التي أدخلتها. يمكنك مراجعة هذه البيانات بعناية وإجراء أي تعديلات ضرورية.\n\nبمجرد التأكد من صحة البيانات، يمكنك النقر على زر \"إرسال\" لإرسال الطلب إلى الوزارة للمعالجة.\n\nوتتيح لك ميزة المعاينة النهائية التأكد من أن جميع المعلومات المقدمة صحيحة وكاملة، مما يساعد على تجنب أي تأخير أو رفض للطلب بسبب أخطاء في البيانات.")
            },
            content("user") {
                text("هل يمكن حفظ الطلب وإرساله في وقت لاحق؟")
            },
            content("model") {
                text("نعم، توفر جميع منصات وزارة البيئة والمياه والزراعة القدرة على حفظ الطلب كمسودة وإعادة إرساله وقت الحاجة.\n\nعند ملء نموذج الطلب، يمكنك النقر على زر \"حفظ\" لحفظ الطلب كمسودة. سيتم تخزين بيانات الطلب على النظام ويمكنك استعادتها لاحقًا لإكمالها وإرسالها.\n\nلاستعادة مسودة الطلب، يمكنك تسجيل الدخول إلى المنصة الإلكترونية للوزارة والانتقال إلى قسم \"طلباتي\". ستجد قائمة بالطلبات المحفوظة كمسودات. يمكنك النقر على الطلب الذي تريد استكماله والنقر على زر \"تعديل\" لإجراء أي تعديلات وإرساله.\n\nتتيح لك ميزة حفظ الطلب إيقاف عملية التقديم مؤقتًا واستكمالها في وقت مناسب لك. كما تتيح لك مراجعة الطلب وإجراء التعديلات اللازمة قبل إرساله النهائي.")
            },
            content("user") {
                text("هل يتطلب مني إعادة إدخال البيانات عند إرسال كل طلب؟")
            },
            content("model") {
                text("لا، لا تتطلب منصات وزارة البيئة والمياه والزراعة إعادة إدخال البيانات للمستفيدين عند إرسال كل طلب.\n\nعند التسجيل في منصات الوزارة، يتم تخزين بياناتك الشخصية والبيانات المتعلقة بمنشأتك (إذا كنت ممثلاً لمنشأة). وعند تقديم طلب لاحق، سيتم استرجاع هذه البيانات تلقائيًا من النظام.\n\nيُطلب منك فقط مراجعة البيانات المعروضة والتأكد من أنها لا تزال صحيحة وكاملة. يمكنك إجراء أي تعديلات ضرورية قبل إرسال الطلب.\n\nتساعد هذه الميزة في توفير الوقت والجهد للمستخدمين، حيث لا يحتاجون إلى إعادة إدخال نفس البيانات مرارًا وتكرارًا عند تقديم طلبات متعددة.")
            },
            content("user") {
                text("ما هي البيانات الشخصية المطلوبة في التسجيل في المنصات الإلكترونية؟")
            },
            content("model") {
                text("تختلف البيانات الشخصية المطلوبة عند التسجيل في المنصات الإلكترونية لوزارة البيئة والمياه والزراعة حسب نوع المستخدم (فرد أو منشأة).\n\n*بالنسبة للأفراد:\n\n الاسم الكامل\n* رقم الهوية الوطنية\n* رقم الجوال\n* البريد الإلكتروني\n\n*بالنسبة للمنشآت:\n\n الاسم التجاري للمنشأة\n* رقم السجل التجاري\n* رقم هاتف المنشأة\n* البريد الإلكتروني للمنشأة\n* اسم ممثل المنشأة\n* رقم الجوال الخاص بممثل المنشأة\n* البريد الإلكتروني الخاص بممثل المنشأة\n\nبالإضافة إلى ذلك، قد تطلب بعض الخدمات معلومات إضافية ذات صلة بالخدمة المقدمة. على سبيل المثال، قد يُطلب منك تقديم معلومات عن موقعك الجغرافي أو نوع النشاط التجاري الذي تمارسه.\n\nوتستخدم وزارة البيئة والمياه والزراعة هذه البيانات الشخصية للتحقق من هوية المستخدمين وضمان صحة الطلبات المقدمة. كما تُستخدم هذه البيانات للتواصل مع المستخدمين بشأن طلباتهم وتقديم المعلومات والخدمات ذات الصلة.")
            },
            content("user") {
                text("في حالة الشك بوجود تسمم بالرصاص أو أي مشكلة في جودة المياه، كيف يمكن فحص المياه والتأكد")
            },
            content("model") {
                text("في حالة الشك بوجود تسمم بالرصاص أو أي مشكلة في جودة المياه، يمكنك اتباع الخطوات التالية لفحص المياه والتأكد:\n\n1. *اتصل بشركة المياه المحلية:* يمكنك الاتصال بشركة المياه التي تخدم منطقتك والإبلاغ عن مخاوفك. ستقوم الشركة بإرسال فني لجمع عينة من المياه وفحصها.\n2. *استخدم مجموعة اختبار المياه المنزلية:* تتوفر مجموعات اختبار المياه المنزلية في معظم متاجر الأجهزة والمستلزمات المنزلية. يمكن لهذه المجموعات الكشف عن مجموعة متنوعة من الملوثات، بما في ذلك الرصاص.\n3. *أرسل عينة إلى مختبر مستقل:* يمكنك جمع عينة من المياه وإرسالها إلى مختبر مستقل لإجراء تحليل شامل. ستوفر لك نتائج التحليل معلومات مفصلة عن جودة المياه لديك.\n\n*ملاحظة:* إذا كنت قلقًا بشأن تسمم الرصاص على وجه التحديد، فإليك بعض العلامات التي يجب البحث عنها:\n\n* الصدأ أو الترسبات الحمراء أو البنية في السباكة\n* طعم أو رائحة معدنية في الماء\n* انخفاض ضغط الماء\n* تآكل في المواسير أو التجهيزات\n\nإذا لاحظت أيًا من هذه العلامات، فمن المهم فحص المياه بحثًا عن الرصاص في أقرب وقت ممكن.")
            },
            content("user") {
                text("كيف يتم حساب المياه الغير محالة لسكان ضاحية الملك فهد بالدمام؟")
            },
            content("model") {
                text("وفقًا لموافقة معالي وزير البيئة والمياه والزراعة بتاريخ 12/02/1438هـ على عرض لجنة دراسة الفوترة رقم )338/1/1437(، يتم حساب المياه غير المحالة لسكان ضاحية الملك فهد بالدمام على النحو التالي:\n\n* *إذا كانت المياه صالحة للشرب:* تكون فاتورة المياه الشهرية مساوية للكمية الكلية للمياه بالتعرفة الجديدة.\n* *إذا كانت المياه غير صالحة للشرب:* تكون فاتورة المياه الشهرية مساوية لنصف الكمية الكلية للمياه بالتعرفة الجديدة.\n\nبمعنى آخر، إذا كنت تستخدم 100 متر مكعب من المياه شهريًا، وكانت المياه صالحة للشرب، فستكون فاتورة المياه الخاصة بك وفقًا للتعرفة الجديدة. أما إذا كانت المياه غير صالحة للشرب، فستكون فاتورة المياه الخاصة بك نصف التعرفة الجديدة لـ 100 متر مكعب.")
            },
            content("user") {
                text("ما هي شهادة السجل الزراعي؟")
            },
            content("model") {
                text("شهادة السجل الزراعي هي مستند رسمي يصدر من وزارة البيئة والمياه والزراعة لكل شاغل موقع زراعي بعد أن يستوفي متطلبات منح هذا المستند.\n\nوتعتبر شهادة السجل الزراعي دليلاً على أن شاغل الموقع الزراعي مسجل لدى الوزارة، وأن الموقع الزراعي مستوفٍ للاشتراطات النظامية لممارسة النشاط الزراعي.\n\nوتتضمن شهادة السجل الزراعي المعلومات التالية:\n\n* اسم شاغل الموقع الزراعي\n* رقم الهوية الوطنية أو الإقامة لشاغل الموقع الزراعي\n* رقم السجل الزراعي\n* مساحة الموقع الزراعي\n* نوع النشاط الزراعي الممارس في الموقع الزراعي\n* تاريخ إصدار الشهادة وتاريخ انتهائها\n\nوتستخدم شهادة السجل الزراعي في العديد من المعاملات والخدمات المتعلقة بالقطاع الزراعي، مثل:\n\n* الحصول على الدعم والخدمات من وزارة البيئة والمياه والزراعة\n* التقدم بطلب للحصول على قروض وتسهيلات مالية من البنوك والمؤسسات المالية\n* تسويق المنتجات الزراعية\n* استيراد وتصدير المنتجات الزراعية\n\nويجب على جميع شاغلي المواقع الزراعية الحصول على شهادة السجل الزراعي لممارسة النشاط الزراعي بشكل قانوني والاستفادة من الخدمات والدعم الذي تقدمه وزارة البيئة والمياه والزراعة.")
            },
            content("user") {
                text("ما هو السجل الزراعي؟")
            },
            content("model") {
                text("السجل الزراعي هو عبارة عن التوثيق الوصفي والبياني للنشاط أو الأنشطة الزراعية التي يقوم بها شاغل الموقع الزراعي.\n\nويشمل السجل الزراعي المعلومات التالية:\n\n* بيانات شاغل الموقع الزراعي (الاسم، رقم الهوية الوطنية أو الإقامة، العنوان، رقم الهاتف، البريد الإلكتروني)\n* بيانات الموقع الزراعي (المساحة، العنوان، نوع التربة، نوع الري، المحاصيل المزروعة، الثروة الحيوانية)\n* بيانات الإنتاج الزراعي (كميات الإنتاج، أنواع المحاصيل، جودة الإنتاج)\n* بيانات المدخلات الزراعية المستخدمة (الأسمدة، المبيدات، الأعلاف)\n* بيانات العمليات الزراعية (طرق الزراعة، الري، الحصاد، التسميد)\n\nيتم تسجيل السجل الزراعي لدى وزارة البيئة والمياه والزراعة، ويحصل شاغل الموقع الزراعي على شهادة السجل الزراعي بعد استيفاء المتطلبات النظامية.\n\nويهدف السجل الزراعي إلى تنظيم وتطوير القطاع الزراعي في المملكة العربية السعودية من خلال:\n\n* توفير قاعدة بيانات شاملة عن النشاط الزراعي في المملكة\n* تسهيل تقديم الدعم والخدمات للمزارعين والمستثمرين الزراعيين\n* مراقبة الإنتاج الزراعي وضمان جودته وسلامته\n* تحسين التخطيط الزراعي واتخاذ القرارات المستنيرة\n* تعزيز الاستثمار في القطاع الزراعي وجذب المستثمرين\n\nويعتبر السجل الزراعي أداة مهمة لوزارة البيئة والمياه والزراعة في تحقيق أهدافها الاستراتيجية لتنمية القطاع الزراعي في المملكة العربية السعودية.")
            }
//            content("user") {
//                text("ماهي وصيل؟\nتم تصميم هذه اإلرشادات الخاصة بالعالمة\nالتجارية لضمان مظهر متسق ونبرة\nمتسقة في جميع اتصاالت وصيل\nماهي العالمة لوصيل؟\nعالمة وصيل التجارية التميز وعادة ما\nتكون بمثابة االنطباع األول عن وصيل مع\nأي جمهور شخصًيا أو عبر اإلنترنت. ولكل\nمنها دور محدد تؤديه، عالمتنا التجارية وما\nتمثله وكيفية التعبير عنها بأفضل طريقة\nممكنة.\nكيف نمكن تكنلوجيا وصيل؟\nتمكين التكنولوجيا لدى وصيل يتم من\nاالرتقاء بالنظام البيئي للرعاية الصحية من\nأجل البشرية األفضل. يقدم نهجنا متعدد\nاألوجه نتائج ال مثيل لها في مجال النظام\nالبيئي الصحي.\nماهي القيم األساسية لوصيل؟\nالرعاية\nتعزيز بيئة العمل الداعمة\nتشجع االبداع والتعاون نحن نعطي\nاألولية لرفاهية فريقنا\nوصيل\nماهو قيم المرضى لدى وصيل؟\nفي قلب مهمتنا يوجد التزام عميق\nبتوفير رعاية استثنائية لهم\nمرضانا، وضمان راحتهم وتعزيز\nرفاهيتهم بشكل عام.\nماذا تقدم وصيل ؟\nنقدم منتجات وخدمات عالية الجودة\nمصممة خصيًصا لتلبية احتياجات\nعمالئنا.\nماهو استثمار وصيل ؟\nنستثمر في الحلول التي تعود بالنفع\nعلى بيئتنا ومجتمعنا.\nنتبنى أفكاًرا وفرًصا جديدة للنمو •\n والتحسين\nماهي مصداقية وصيل؟\nنحن نقدم التميز باستمرار، ونذهب\nإلى أبعد الحدود لضمان اإلنجاز\nماهي عالقة وصيل مع العمالء ؟\nعالقتنا طويلة األمد مع العمالء\nوالشركاء مبنية على الثقة واالحترام\nالمتبادل")
//            },
//            content("model") {
//                text("*ماهي وصيل؟\n\nوصيل هي علامة تجارية ترمز للتميز في مجال الرعاية الصحية.\n\nكيف نمكن تكنلوجيا وصيل؟\n\n ارتقاء بالنظام البيئي للرعاية الصحية من أجل البشرية الأفضل\n* تقديم نتائج لا مثيل لها في مجال النظام البيئي الصحي من خلال نهج متعدد الأوجه\n\n*القيم الأساسية لوصيل:\n\n الرعاية\n* تعزيز بيئة عمل داعمة\n* تشجيع الإبداع والتعاون\n* إعطاء الأولوية لرفاهية الفريق\n\n*قيم المرضى لدى وصيل:\n\n التزام عميق بتوفير رعاية استثنائية\n* ضمان راحة المرضى وتعزيز رفاهيتهم\n\n*ما الذي تقدمه وصيل؟\n\n منتجات وخدمات عالية الجودة مصممة لتلبية احتياجات العملاء\n\n*ما الذي تستثمره وصيل؟\n\n الحلول التي تعود بالنفع على البيئة والمجتمع\n* الأفكار وفرص النمو والتحسين الجديدة\n\n*مصداقية وصيل:\n\n تقديم التميز باستمرار\n* الذهاب إلى أبعد الحدود لضمان الإنجاز\n\n*علاقة وصيل مع العملاء:\n\n علاقات طويلة الأمد مبنية على الثقة والاحترام المتبادل")
//            },
//            content("user") {
//                text("ماهو وصيل؟")
//            },
//            content("model") {
//                text("وصيل هي علامة تجارية تمثل التميز في مجال الرعاية الصحية. تم تصميمها لارتقاء النظام البيئي للرعاية الصحية من أجل البشرية الأفضل. تقدم وصيل نتائج لا مثيل لها في مجال النظام البيئي الصحي من خلال نهجها متعدد الأوجه.\n\nتلتزم وصيل بتقديم رعاية استثنائية للمرضى، وضمان راحتهم وتعزيز رفاهيتهم بشكل عام. كما أنها تستثمر في الحلول التي تعود بالنفع على البيئة والمجتمع.\n\nالقيم الأساسية لوصيل هي الرعاية وتعزيز بيئة عمل داعمة وتشجيع الإبداع والتعاون وإعطاء الأولوية لرفاهية الفريق.\n\nعلاقات وصيل طويلة الأمد مع العملاء والشركاء مبنية على الثقة والاحترام المتبادل.")
//            },
//            content("user") {
//                text("ماهي العالمة لوصيل؟")
//            },
//            content("model") {
//                text("عالمة وصيل التجارية هي تمثيل مرئي لقيمها والتزامها بالتميز في مجال الرعاية الصحية. تتكون العلامة التجارية من:\n\n* *الشعار:* يتكون شعار وصيل من اسم الشركة \"وصيل\" بخط أنيق وحديث. يعكس الشعار بساطة ووضوح رسالة الشركة.\n* *اللون:* تستخدم وصيل اللون الأزرق الداكن كلون رئيسي لها. يرمز اللون الأزرق إلى الثقة والموثوقية والمهنية، وهي صفات ترتبط ارتباطًا وثيقًا بمجال الرعاية الصحية.\n* *الخط:* تستخدم وصيل خطًا بسيطًا وسهل القراءة في جميع اتصالاتها. يعكس الخط وضوح رسالة الشركة ونهجها المباشر.\n\nبالإضافة إلى هذه العناصر المرئية، فإن عالمة وصيل التجارية تتضمن أيضًا صوتًا مميزًا ونبرة محددة. يستخدم صوت وصيل لغة واضحة وموجزة توصل رسالتها بطريقة فعالة. كما أن نبرتها مهنية وداعمة، مما يعكس قيم الشركة ورعايتها.\n\nبشكل عام، تعكس عالمة وصيل التجارية التزامها بالتميز والابتكار في مجال الرعاية الصحية. إنها علامة تجارية مصممة لإلهام الثقة والاحترام، وتعكس قيم الشركة والتزامها بتقديم رعاية استثنائية للمرضى.")
//            },
//            content("user") {
//                text("كيف نمكن تكنلوجيا وصيل؟")
//            },
//            content("model") {
//                text("تمكن تكنولوجيا وصيل من خلال نهج متعدد الأوجه يركز على:\n\n* *تحسين تجربة المريض:* توفر وصيل منصات رقمية سهلة الاستخدام تتيح للمرضى الوصول إلى سجلاتهم الصحية وإدارة مواعيدهم والتواصل مع مقدمي الرعاية الصحية لديهم.\n* *تحسين كفاءة الرعاية:* تستخدم وصيل تقنيات مثل الذكاء الاصطناعي والتعلم الآلي لتحسين كفاءة الرعاية. على سبيل المثال، يمكن استخدام الذكاء الاصطناعي لتحديد المرضى المعرضين لخطر حدوث مضاعفات، مما يسمح بالتدخل المبكر.\n* *توسيع نطاق الوصول إلى الرعاية:* تتيح تقنيات وصيل للمرضى الوصول إلى الرعاية الصحية من أي مكان، مما يزيل الحواجز الجغرافية والمالية. على سبيل المثال، تقدم وصيل خدمات التطبيب عن بعد التي تتيح للمرضى استشارة مقدمي الرعاية الصحية افتراضيًا.\n* *تعزيز التعاون بين مقدمي الرعاية:* تربط تقنيات وصيل مقدمي الرعاية الصحية معًا، مما يسمح لهم بمشاركة المعلومات والت協作 لتقديم رعاية أفضل للمرضى.\n* *دعم البحث والتطوير:* تستثمر وصيل في البحث والتطوير لاستكشاف طرق جديدة لاستخدام التكنولوجيا لتحسين الرعاية الصحية. على سبيل المثال، تعمل وصيل على تطوير تقنيات جديدة للتشخيص المبكر للأمراض.\n\nمن خلال هذا النهج متعدد الأوجه، تمكن تكنولوجيا وصيل من تحسين تجربة المرضى، وتعزيز كفاءة الرعاية، وتوسيع نطاق الوصول إلى الرعاية، ودعم البحث والتطوير.")
//            },
//            content("user") {
//                text("ماهي القيم األساسية لوصيل؟")
//            },
//            content("model") {
//                text("القيم الأساسية لوصيل هي:\n\n* *الرعاية:* تضع وصيل رفاهية المرضى والموظفين في صميم كل ما تفعله. فهي ملتزمة بتقديم رعاية استثنائية وتعزيز بيئة عمل داعمة.\n* *التعاون:* تؤمن وصيل بقوة العمل الجماعي. فهي تشجع التعاون بين الموظفين والفرق ومقدمي الرعاية الصحية الآخرين من أجل تقديم أفضل رعاية ممكنة للمرضى.\n* *الابتكار:* تلتزم وصيل بالابتكار والبحث عن طرق جديدة لتحسين الرعاية الصحية. فهي تستثمر في البحث والتطوير وتتطلع باستمرار إلى إيجاد حلول جديدة للتحديات التي تواجه النظام الصحي.\n* *المصداقية:* تعتز وصيل بسمعتها كمؤسسة موثوقة وذات مصداقية. فهي تلتزم بأعلى معايير الجودة والنزاهة في جميع جوانب عملها.\n* *المساءلة:* تؤمن وصيل بالمساءلة عن أفعالها. فهي ملتزمة بتحقيق التميز في كل ما تفعله وتسعى باستمرار إلى تحسين خدماتها.\n\nهذه القيم الأساسية توجه جميع جوانب عمل وصيل، من كيفية تفاعلها مع المرضى إلى كيفية تطويرها لتقنياتها. فهي ملتزمة بتقديم رعاية استثنائية وتحسين النظام الصحي من أجل البشرية الأفضل.")
//            },
//            content("user") {
//                text("ماهو قيم المرضى لدى وصيل؟")
//            },
//            content("model") {
//                text("قيم المرضى لدى وصيل هي:\n\n* *الرعاية التي تركز على المريض:* تضع وصيل المريض في صميم كل ما تفعله. فهي ملتزمة بتوفير رعاية مخصصة تلبي احتياجات كل مريض على حدة.\n* *التواصل الواضح والمفتوح:* تؤمن وصيل بأن التواصل المفتوح والصادق أمر ضروري لبناء الثقة مع المرضى. فهي تشجع المرضى على طرح الأسئلة والمشاركة في صنع القرار بشأن رعايتهم.\n* *الاحترام والتعاطف:* تعامل وصيل مرضاها باحترام وتعاطف. فهي تفهم أن المرضى يمرون بتجارب صعبة، وتسعى جاهدة لتوفير بيئة داعمة ومريحة.\n* *الوصول إلى الرعاية عالية الجودة:* تعتقد وصيل أن جميع المرضى يجب أن يكون لديهم إمكانية الوصول إلى رعاية عالية الجودة. فهي تعمل على إزالة الحواجز التي تحول دون حصول المرضى على الرعاية التي يحتاجون إليها، مثل التكاليف المرتفعة والمسافة الجغرافية.\n* *التحسين المستمر:* تلتزم وصيل بالتحسين المستمر لتجربة المرضى. فهي تسعى باستمرار إلى التعليقات من المرضى وتستخدم هذه التعليقات لتحسين خدماتها.\n\nهذه القيم توجه جميع جوانب تفاعلات وصيل مع المرضى. فهي ملتزمة بتوفير رعاية استثنائية وتعزيز رفاهية المرضى بشكل عام.")
//            },
//            content("user") {
//                text("ماذا تقدم وصيل ؟")
//            },
//            content("model") {
//                text("تقدم وصيل مجموعة شاملة من المنتجات والخدمات عالية الجودة المصممة لتلبية احتياجات عملائها في مجال الرعاية الصحية. وتشمل هذه:\n\n* *خدمات المستشفيات:* تدير وصيل شبكة من المستشفيات التي تقدم مجموعة واسعة من الخدمات الطبية والجراحية، بما في ذلك رعاية القلب والأوعية الدموية والسرطان وجراحة العظام ورعاية الأمومة.\n* *الرعاية الأولية:* تقدم وصيل خدمات الرعاية الأولية من خلال عياداتها المجتمعية ومراكز الرعاية العاجلة. وتشمل هذه الخدمات الفحوصات البدنية والتلقيحات وإدارة الأمراض المزمنة.\n* *الرعاية المنزلية:* توفر وصيل مجموعة من خدمات الرعاية المنزلية، مثل التمريض ورعاية المسنين والعلاج الطبيعي. وهي مصممة لتلبية احتياجات المرضى الذين يحتاجون إلى رعاية إضافية في المنزل.\n* *التكنولوجيا الصحية:* تستثمر وصيل في تطوير تقنيات صحية مبتكرة لتحسين تجربة المرضى وتعزيز كفاءة الرعاية. وتشمل هذه التقنيات منصات رقمية سهلة الاستخدام وخدمات التطبيب عن بعد وأدوات الذكاء الاصطناعي.\n* *خدمات الدعم:* تقدم وصيل أيضًا مجموعة من خدمات الدعم لمرضاها، مثل خدمات إدارة الحالة وإدارة الأدوية والخدمات الاجتماعية. وهي مصممة لمساعدة المرضى على إدارة رعايتهم وتحسين صحتهم بشكل عام.\n\nمن خلال تقديم هذه المجموعة الشاملة من المنتجات والخدمات، تلتزم وصيل بتوفير رعاية استثنائية للمرضى وتحسين النظام الصحي من أجل البشرية الأفضل.")
//            },
//            content("user") {
//                text("ماهو استثمار وصيل ؟ ")
//            },
//            content("model") {
//                text("تستثمر وصيل في المجالات التالية:\n\n* *البحث والتطوير:* تستثمر وصيل بشكل كبير في البحث والتطوير لاستكشاف طرق جديدة لتحسين الرعاية الصحية. ويشمل ذلك تطوير تقنيات جديدة وعلاجات وأدوية.\n* *التعليم والتدريب:* تستثمر وصيل في تعليم وتدريب موظفيها لضمان حصول المرضى على أفضل رعاية ممكنة. ويشمل ذلك توفير فرص التعليم المستمر ودعم برامج التدريب.\n* *البنية التحتية للرعاية الصحية:* تستثمر وصيل في البنية التحتية للرعاية الصحية، مثل المستشفيات والعيادات ومراكز الرعاية العاجلة. ويهدف ذلك إلى ضمان حصول المرضى على إمكانية الوصول إلى مرافق حديثة ومجهزة تجهيزًا جيدًا.\n* *الحلول التي تعود بالنفع على البيئة والمجتمع:* تستثمر وصيل في الحلول التي تعود بالنفع على البيئة والمجتمع. ويشمل ذلك الاستثمار في الطاقة المتجددة وبرامج الصحة المجتمعية ومبادرات المسؤولية الاجتماعية للشركات.\n\nمن خلال هذه الاستثمارات، تلتزم وصيل بتحسين الرعاية الصحية وتعزيز رفاهية المرضى والمجتمعات التي تخدمها.")
//            },
//            content("user") {
//                text("ماهي مصداقية وصيل؟")
//            },
//            content("model") {
//                text("تحافظ وصيل على مصداقيتها من خلال:\n\n* *تقديم التميز باستمرار:* تلتزم وصيل بتقديم رعاية استثنائية للمرضى في جميع الأوقات. فهي تضع معايير عالية للجودة وتسعى باستمرار لتحسين خدماتها.\n* *الذهاب إلى أبعد الحدود لضمان الإنجاز:* يتجاوز موظفو وصيل باستمرار التوقعات لضمان حصول المرضى على أفضل رعاية ممكنة. فهم ملتزمون بإنجاز المهمة بشكل صحيح في كل مرة.\n* *الصدق والنزاهة:* تتمسك وصيل بأعلى معايير الأخلاق في جميع أعمالها. فهي صادقة وشفافة مع مرضاها وموظفيها وشركائها.\n* *المساءلة:* تعتبر وصيل نفسها مسؤولة عن أفعالها. فهي تسعى باستمرار إلى التعليقات من المرضى والموظفين وتستخدم هذه التعليقات لتحسين خدماتها.\n* *السمعة القوية:* تتمتع وصيل بسمعة قوية كمؤسسة موثوقة وذات مصداقية. وقد تم الاعتراف بها لجودة رعايتها والتزامها بالتميز.\n\nمن خلال الحفاظ على هذه المعايير العالية، تحافظ وصيل على مصداقيتها كمؤسسة رعاية صحية رائدة.")
//            },
//            content("user") {
//                text("ماهي عالقة وصيل مع العمالء ؟")
//            },
//            content("model") {
//                text("بصفتها مؤسسة رعاية صحية رائدة، تتمتع وصيل بعلاقات طويلة الأمد مع عملائها (المرضى) والشركاء مبنية على الثقة والاحترام المتبادل. وهي ملتزمة ببناء علاقات قوية مع عملائها من خلال:\n\n* *تقديم رعاية استثنائية:* تضع وصيل احتياجات عملائها في صميم كل ما تفعله. فهي ملتزمة بتقديم رعاية عالية الجودة ورحيمة لكل مريض.\n* *التواصل المفتوح والصادق:* تؤمن وصيل بأن التواصل المفتوح والصادق أمر ضروري لبناء الثقة مع العملاء. فهي تشجع عملائها على طرح الأسئلة والمشاركة في صنع القرار بشأن رعايتهم.\n* *الاستماع إلى التعليقات:* تقدر وصيل آراء عملائها وتسعى باستمرار إلى الحصول على تعليقاتهم. فهي تستخدم هذه التعليقات لتحسين خدماتها وتلبية احتياجات العملاء بشكل أفضل.\n* *الالتزام بالتحسين المستمر:* تلتزم وصيل بالتحسين المستمر لتجربة العملاء. فهي تبحث باستمرار عن طرق لتحسين خدماتها وتوفير أفضل رعاية ممكنة لعملائها.\n\nمن خلال بناء علاقات قوية مع عملائها، تهدف وصيل إلى توفير تجربة رعاية صحية إيجابية ومريحة.")
//            },
//            content("user") {
//                text("ماهوالتصوير الفوتوغرافي لدى وصيل ؟ ")
//            },
//            content("model") {
//                text("عالم التصوير الفوتوغرافي الخاص بوصيل هو انعكاس لقيمها والتزامها بالتميز في مجال الرعاية الصحية. فهو يلتقط لحظات حقيقية من الرعاية والتعاطف والابتكار.\n\nيتميز التصوير الفوتوغرافي لوصيل بما يلي:\n\n* *التركيز على المرضى:* يظهر التصوير الفوتوغرافي لوصيل المرضى في صميم كل شيء. فهو يلتقط قصصهم وتجاربهم الشخصية، مما يسلط الضوء على أهمية الرعاية التي تقدمها وصيل.\n* *التأكيد على فريق الرعاية:* يسلط التصوير الفوتوغرافي لوصيل الضوء على فريق الرعاية المتفاني الذي يقدم رعاية استثنائية للمرضى. فهو يظهر التعاون والعمل الجماعي بين الأطباء والممرضات والموظفين الآخرين.\n* *استخدام الضوء الطبيعي:* يستخدم التصوير الفوتوغرافي لوصيل في الغالب الضوء الطبيعي لخلق جو دافئ ودعوة. فهو يلتقط الجمال الطبيعي للمرافق والبيئات التي يقدم فيها المرضى الرعاية.\n* *تجنب الصور النمطية:* يعمل التصوير الفوتوغرافي لوصيل على تجنب الصور النمطية المرتبطة عادةً بالرعاية الصحية. فهو يصور المرضى والأطباء والموظفين على أنهم أشخاص حقيقيون لهم قصصهم الفريدة.\n* *استخدام الألوان الدافئة والمهدئة:* غالبًا ما يستخدم التصوير الفوتوغرافي لوصيل ألوانًا دافئة ومهدئة لإضفاء شعور بالراحة والاطمئنان. فهو يهدف إلى خلق بيئة بصرية إيجابية للمشاهدين.\n\nبشكل عام، يعكس التصوير الفوتوغرافي لوصيل التزامها بتقديم رعاية استثنائية وتعزيز رفاهية المرضى والمجتمعات التي تخدمها.")
//            },
//            content("user") {
//                text("ماهوالتصوير الفوتوغرافي لدى وصيل ؟\nإن االستخدام الصحيح واختيار الصور ال يقل\nأهمية عن اختيار الكلمات المناسبة\nالستخدامها أمام عمالئنا. لقد نسبنا قيمنا\nإلى نوع الصور التي تبث شخصيتنا واحترافنا\nبشكل أفضل.")
//            },
//            content("model") {
//                text("أنت على حق في أن اختيار الصور واستخدامها الصحيح لا يقل أهمية عن اختيار الكلمات المناسبة عند التواصل مع العملاء. وقد حددت وصيل قيمها بعناية واختارت نوع الصور التي تنقل شخصيتها واحترافها بشكل أفضل.\n\nإليك بعض الإرشادات التي تستخدمها وصيل عند اختيار واستخدام الصور:\n\n* *التوافق مع القيم:* تختار وصيل الصور التي تتوافق مع قيمها الأساسية المتمثلة في الرعاية والتعاون والابتكار والمصداقية والمساءلة. على سبيل المثال، قد تستخدم صورة لفريق طبي يبتسم ويتعاون لتقديم رعاية للمريض لإظهار قيمة التعاون.\n* *الأصالة والواقعية:* تفضل وصيل الصور الأصلية والواقعية التي تصور لحظات حقيقية من الرعاية والتعاطف. إنها تتجنب الصور التي تبدو مصطنعة أو مبالغ فيها.\n* *التنوع والشمول:* تسعى وصيل إلى تضمين التنوع والشمول في صورها. فهي تصور أشخاصًا من خلفيات وخبرات مختلفة لإظهار التزامها تجاه خدمة جميع المرضى والمجتمعات.\n* *الجودة العالية:* تستخدم وصيل صورًا عالية الجودة من الناحية الفنية والتي تم التقاطها باستخدام معدات وإضاءة احترافية. فهي تريد أن تنقل شعورًا بالثقة والاحتراف في جميع صورها.\n* *الاستخدام المتسق:* تستخدم وصيل صورها بشكل متسق في جميع قنوات اتصالها، بما في ذلك الموقع الإلكتروني ومنصات التواصل الاجتماعي والمواد التسويقية. وهذا يساعد على خلق هوية علامة تجارية قوية ومتماسكة.\n\nمن خلال اتباع هذه الإرشادات، تضمن وصيل أن صورها فعالة في نقل قيمها والتواصل مع العملاء على مستوى شخصي.")
//            },
//            content("user") {
//                text("ماذا تعرف  عن وصيل")
//            },
//            content("model") {
//                text("وصيل هي علامة تجارية رائدة في مجال الرعاية الصحية ملتزمة بتقديم رعاية استثنائية وتحسين النظام الصحي من أجل البشرية الأفضل.\n\n*القيم الأساسية لوصيل:\n\n الرعاية\n* التعاون\n* الابتكار\n* المصداقية\n* المساءلة\n\n*خدمات وصيل:\n\n خدمات المستشفيات\n* الرعاية الأولية\n* الرعاية المنزلية\n* التكنولوجيا الصحية\n* خدمات الدعم\n\n*استثمارات وصيل:\n\n البحث والتطوير\n* التعليم والتدريب\n* البنية التحتية للرعاية الصحية\n* الحلول التي تعود بالنفع على البيئة والمجتمع\n\n*مصداقية وصيل:\n\n تقديم التميز باستمرار\n* الذهاب إلى أبعد الحدود لضمان الإنجاز\n* الصدق والنزاهة\n* المساءلة\n* السمعة القوية\n\n*علاقة وصيل مع العملاء:\n\n علاقات طويلة الأمد مبنية على الثقة والاحترام المتبادل\n* تقديم رعاية استثنائية\n* التواصل المفتوح والصادق\n* الاستماع إلى التعليقات\n* الالتزام بالتحسين المستمر\n\n*التصوير الفوتوغرافي لوصيل:\n\n يركز على المرضى\n* يؤكد على فريق الرعاية\n* يستخدم الضوء الطبيعي\n* يتجنب الصور النمطية\n* يستخدم ألوانًا دافئة ومهدئة\n\n*شعار وصيل:\n\n يتكون من اسم الشركة \"وصيل\" بخط أنيق وحديث\n* يعكس بساطة ووضوح رسالة الشركة\n\n*لون وصيل:\n\n تستخدم وصيل اللون الأزرق الداكن كلون رئيسي لها\n* يرمز اللون الأزرق إلى الثقة والموثوقية والمهنية\n\n*خط وصيل:\n\n تستخدم وصيل خطًا بسيطًا وسهل القراءة في جميع اتصالاتها\n* يعكس الخط وضوح رسالة الشركة ونهجها المباشر")
//            },

        )

//        history+=faqs.map {
//            content("user") { text(it.question) }
//            content("model") { text(it.answer) }
//        }

        model?.let {
            chat = it.startChat(chatHistory) // تهيئة الدردشة وتخزينها في chat
            chat?.let {
              var  docs2="السؤال: ما هي الدول المسموح استيراد الخيول منها إلى المملكة؟\n" +
                        "الجواب: التابعة للوزارة منها (الولايات المتحدة الأمريكية وكندا والاتحاد الأوروبي وأستراليا ونيوزيلندا والإمارات وقطر وعمان واليابان وبعض من دول آسيا).\n" +
                        "السؤال: ما هي الجهة المسؤولة عن إصدار شهادة صحية لتصدير الخيول؟\n" +
                        "الجواب: إدارة المحجر الدولي للخيل بالجنادرية.\n" +
                        " السؤال: ما هي شروط الحصول على إذن استيراد الحيوانات الحية دون رسوم مالية؟\n" +
                        "الجواب: تقديم الطلب على المنصة الإلكترونية \"نما\"، وإرفاق نسخة من السجل التجاري أو الهوية الوطنية، وإثبات وجود مكان مناسب لإيواء الحيوانات.\n" +
                        " السؤال: كيف يمكن التسجيل في البوابة الإلكترونية لوزارة البيئة والمياه والزراعة؟\n" +
                        "الجواب: من خلال بوابة النفاذ الموحد لجميع الخدمات والمنصات الإلكترونية \"نفاذ\".\n" +
                        " السؤال: هل يمكن معاينة الطلب بشكل نهائي قبل إرساله؟\n" +
                        "الجواب: نعم، توفر المنصات القدرة على معاينة واستعراض بيانات الطلب قبل الإرسال النهائي.\n" +
                        "السؤال: ما هي البيانات الشخصية المطلوبة في التسجيل في المنصات الإلكترونية؟\n" +
                        "الجواب: لا تتطلب المنصات ادخال البيانات الشخصية، حيث يتم استرجاعها من منصة \"أبشر\".\n" +
                        " السؤال: كيف يتم حساب المياه غير المحالة لسكان ضاحية الملك فهد بالدمام؟\n" +
                        "الجواب: إذا كانت المياه صالحة للشرب، فإن الفاتورة الشهرية تساوي الكمية الكلية للمياه بالتعرفة الجديدة، وإذا كانت غير صالحة للشرب، فإن الفاتورة تساوي نصف الكمية بالتعرفة الجديدة.\n" +
                        "السؤال: ما هي شهادة السجل الزراعي؟\n" +
                        "الجواب: مستند رسمي يصدر من وزارة الزراعة لكل شاغل موقع زراعي يستوفي متطلبات منح هذا المستند."

                var text="يجب ان تكون ردودك مختصرة ومرتبة   ويجب الا تذكر هذه المعلومات ابدا الا اذا طلب منك المستخدم وخذها بالاعتبار عندما يسألوك "
                text+="  \"نما\"ماهي الدول المسموح استيراد الخيل منها للمملكة؟ماهي الجهة المسؤولة عن إصدار شهادة صحية لتصديرالخيول؟يتم الكشف على الخيل المراد تصديرها بعد سحب العينات الالزمة منهاوتحليلها، ومن ثم إصدار الشهادات الصحية الالزمة من قبل \"المحجرالدولي للخيل بالجنادرية\".ماهي الدول المسموح استيراد الخيول منها للمملكة؟يتم االستيراد فقط من دول معتمدة أو من مناطق في دول معتمدة منقبل الوزارة منها )الواليات المتحدة األمريكية وكندا واالتحاد األوربيوأستراليا ونيوزيلندا واإلمارات وقطر وعمان واليابان وبعض من دول أسيا(والتي ينبغي مراجعة الوزارة )المحجر الدولي للخيل بالجنادرية( لمعرفةالعديد من الدول قبل إجراء أي ترتيب الستيراد الخيل ويسمح فقطباستيراد الخيل المسجلة )جواز سفر أو وثيقة تسجيل رسمية(.ما هي الجهة المسؤولة عن إصدار شهادة صحية لتصديرالخيول؟الجهة المسؤولة عن إصدار شهادة صحية هي إدارة المحجر الدوليللخيل بالجنادرية.نموذج عن المملكة العربية السعودية- يسمح الحصول على إذن استيراد للحيوانات الحية \"المواشي الحية\"، دونأي رسوم مالية وفق الضوابط التالية: • التقديم على المنصة اإللكترونيةالخاصة بالوزارة \"نما\". • إرفاق نسخة من السجل التجاري مضاف إليه نشاطمالئم لنوع اإلذن المطلوب )الشركات والمؤسسات فقط(، أو نسخة منالهوية الوطنية لألفراد. • إرفاق ما يثبت وجود مكان مـناسب إليواءالحيوانات الحية \"المواشي\" المستوردة )صك ملكية، عقد إيجار( لألفرادوالمؤسسات والمشاريع، على أن يكون عقد اإليجار مرتبط بتاريخ سريانالسجل التجاري. • إرفاق فاتورة من التحصينات المطلوبة؛ لتحصينالحيوانات المراد استيرادها، قبل الحصول على إذن االستيراد. • في حالاالستيراد من دول الخليج واألردن؛ يجب إرفاق نسخة من ترخيص مشروعإنتاج المواشي الحية من البلد المصدر. • يحق لألفراد استيراد المواشيالحية بعدد )100( رأس للضأن والماعز، أو )15( رأس لألبقار، أو )15( رأسلإلبل خالل السنة الواحدة. - يسمح الحصول على إذن استيراد الطيورالحية دون أي رسوم مالية وفق الضوابط التالية: • التقديم على المنصةاإللكترونية الخاصة بالوزارة \"نما\". • إرفاق نسخة من السجل التجاري مضافإليه نشاط مالئم لنوع اإلذن المطلوب )الشركات والمؤسسات فقط(، أونسخة من الهوية الوطنية، أو جواز السفر، او اإلقامة لألفراد. • فيما يخصاستيراد الطيور بشكل تجاري؛ فيجب الحصول على ترخيص \"مركز استيرادوتوزيع الطيور الحية\"، وإرفاق نسخة منه. • يحق لألفراد استيراد عدد )٦(طيور صغيرة، أو )٣( طيور كبيرة، كل )٦( أشهر. - يسمح الحصول على إذناستيراد بيض التفقيس والصيصان والمنتجات الحيوانية غير المصنعة)للشركات والمؤسسات فقط(، دون أي رسوم مالية وفق الضوابط التالية:• التقديم على المنصة اإللكترونية الخاصة بالوزارة \"نما\". • إرفاق نسخة منالسجل التجاري مضاف إليه نشاط مالئم لنوع اإلذن المطلوب. • فيما يخصاستيراد بيض التفقيس والصيصان فيجب إرفاق نسخة من ترخيص مشروعالدواجن.ماهي شروط الحصول على إذن استيراد الحيوانات الحيةوالطيور وبيض التفقيس والصيصان والمنتجات الحيوانية غيرالمصنعة من دون رسوم مالية؟كيف استطيع التسجيل في البوابة لالستفادة من الخدماتااللكترونية؟اتاحت الوزارة امكانية التسجيل في بوابة الوزارة من خالل بوابة النفاذالموحد لجميع الخدمات والمنصات االلكترونية و بالتكامل مع النفاذالوطني \"ابشر\".ل يتم االستفادة من التعليقات والتقييمات التي يتم ارسالهامن قبل زوار البوابة؟قامت الوزارة باتاحة مؤشرات رقمية لمتابعة تقييم محتوى البوابةوالخدمات بشكل مستمر و آلي وتم نشر نتيجة التقييم على البوابة,وقامت الوزارة بتخصيص فريق لمراجعة أقل الصفحات والخدمات تقييماواعادة تحسينها لرفع جودتها.هل استطيع كقطاع أعمال االستفاده من الخدماتااللكترونية التي تقدمها الوزارة؟الوزارة تتيح خدمات الكترونية لجميع انواع المستفيدين وتستطيعالتسجيل باستخدام رقم السجل التجاري وسوف يتم التحقق واسترجاعبيانات الشركة من بيانات وزارة التجارة واالستثمار.هل أستطيع معاينة الطلب بشكل نهائي قبل ارساله؟توفر جميع منصات الوزارة القدرة على معاينة واستعراض بيانات الطلبقبل االرسال النهائي وذلك لتمكين المستفيد من مراجعة البياناتوالتأكد منها قبل ارسال الطلب.هل أستطيع حفظ الطلب وارساله في وقت الحق؟توفر جميع منصات الوزارة القدرة على حفظ الطلب كمسودة وإعادةإرساله وقت الحاجة.هل يتطلب مني إعادة ادخال البيانات عند ارسال كل طلب؟ال تتطلب المنصات لدى الوزارة إعادة ادخال البيانات للمستفيدين ويتمالتحقق واسترجاع البيانات من الجهات الحكومية ذات العالقة.ما هي البيانات الشخصية المطلوبة في التسجيل فيالمنصات االلكترونية؟ال تتطلب المنصات التابعة للوزارة ادخال البيانات الشخصية وانما سوفيتم استرجاعها من منصة \"أبشر\".في حالة الشك بوجود تسمم بالرصاص أو أي مشكلة فيجودة المياه، كيف يمكن فحص المياه والتأكد؟في حالة االشتباه بوجود تسمم مهما يكن نوعه، فعلى العميل فيالمدن )الرياض، جده، الطائف، وجدة( بزيارة مختبر شركة المياه الوطنيةلفحص العينة، اما في حال كان العميل في غير المدن المذكورة فعليهبالتوجه لمختبر أقرب مديرية مياه أو أحد فروعها.كيف يتم حساب المياه الغير محالة وأنا ساكن في ضاحيةالملك فهد الدمام؟إشارة لموافقة معالي الوزير بتاريخ 12/02/1438هـ على عرض لجنة دراسةالفوترة رقم )338/1/1437( فإنه إذا كانت المياه صالحة للشرب فان فاتورةالمياه الشهرية تساوي الكمية الكلية للمياه بالتعرفة الجديدة، بينما إذاكانت المياه غير صالحة للشرب فإن الفاتورة الشهرية تساوي نصف الكميةالكلية للمياه بالتعرفة الجديدة.ما هي شهادة السجل الزراعي؟هي مستند رسمي يصدر من وزارة الزراعة لكل شاغل موقع زراعي بعد أنيستوفي متطلبات منح هذا المستند.ما هو السجل الزراعي؟السجل الزراعي عبارة عن التوثيق الوصفي والبياني للنشاط أو األنشطةالزراعية التي يقوم بها شاغل الموقع الزراعي.ما هي البيانات الشخصية المطلوبة في التسجيل فيالمنصات االلكترونية؟"
                val response = it.sendMessage("$docs $docs2  $text")
                isLoad=true
            }

        } ?: println("Assistant not initialized")


    }
    var isLoad=false
    suspend fun askAI(text: String,language:String): String {

        if(!isLoad || counterErrors==5) {
            Log.e("isLoad555","isLoad")
            load()
        }

        chat?.let {

            val sgt=  getReqDate(text)
            val invoLanguage=req[language.substring(0,5)]
            Log.d("invoLanguage",language.substring(0,5))
            var notfy="يجب ان تكون ردودك مختصرة ومرتبة  وبلغة منتظمة ولا تزيد عن سطرين  والاجابة تكون بحدود السؤال فقط "
            val response = it.sendMessage("$sgt $text  $invoLanguage $notfy")
            if(response?.text?.isNullOrEmpty()!!) {
                counterErrors++
                return ""
            }
            Log.d("response.text",response?.text!!)
            counterErrors=0
            return response?.text!!
        }
        return ""
    }
    var  counterErrors=0
    suspend fun askAndResponseAnswar(inputText:String?,lang:String, callBack: IGeminiServiceEventListener) {

        try {
            var resAnsware = askAI(inputText!!,lang)
            if (resAnsware?.isNullOrEmpty()==false) {
                //TODO Delete non-text symbols
                resAnsware = filterTextFromSymbols(resAnsware)
                //-------------------------------------------
                //  resAnsware=Helper.removeStars(resAnsware)
                //   Log.d("messageToGeneratorAudio3", lang.toString())

                if(resAnsware?.trim()?.isNullOrEmpty()==true)
                    callBack.onRequestIsFailure("empty")
                else {
                    val response = getUrlAudio(resAnsware!!, lang!!)
                    Log.d("response55", response!!)
                    if (response != null && Helper.isAudioFile(response))
                        callBack.onRequestIsSuccess(GeminiResponse(description = response))
                    else
                        callBack.onRequestIsFailure(response)
                }
            }
        }catch (e:Exception){
            callBack.onRequestIsFailure(e.message.toString())
            Log.e("askAi",e.message.toString())
        }
    }

    suspend fun askAndResponseAnswar(inputText:String?,lang:String):String?{

        var response:String?=null
        try {
            var resAnsware:String? = askAI(inputText!!,lang)

            if (resAnsware?.isNullOrEmpty()==false) {
                //TODO Delete non-text symbols
                resAnsware = filterTextFromSymbols(resAnsware)
                //-------------------------------------------
                //  resAnsware=Helper.removeStars(resAnsware)
                   Log.d("resAnsware", resAnsware)

                if(resAnsware?.trim()?.isNullOrEmpty()==false)
                {
                    response= getUrlAudio(resAnsware!!, lang!!)
                    Log.d("response55", response!!)
                }

            }
        }catch (e:Exception){
            Log.e("erroRAskAi",e.message.toString())
        }
        finally {

            Log.d("askAndResponseAnswar", "response")

            return  response
        }


    }

    suspend fun getUrlAudio(text: String = "", voiceCode: String = "ar-SA-1"): String {
        val url = "https://cloudlabs-text-to-speech.p.rapidapi.com/synthesize"

        val client = OkHttpClient()

        val formBody = FormBody.Builder()
            .add("voice_code", voiceCode)
            .add("text", text)
            .add("speed", "1.00")
            .add("pitch", "1.00")
            .add("output_type", "audio_url")
            .build()

        val request = Request.Builder()
            .url(url)
            .post(formBody)
            .addHeader("content-type", "application/x-www-form-urlencoded")
            .addHeader("X-RapidAPI-Key", "fc89c0c34fmsh67d77f98cbd7176p109440jsnb94ccf8b644d")
            .addHeader("X-RapidAPI-Host", "cloudlabs-text-to-speech.p.rapidapi.com")
            .build()

        return withContext(Dispatchers.IO) {
            try {
                val response = client.newCall(request).execute()
                val jsonResponse = JSONObject(response.body?.string())
                Log.d("jsonResponse55",jsonResponse.toString())
                Log.d("jsonResponse55",jsonResponse.getJSONObject("result").getString("audio_url"))
                jsonResponse.getJSONObject("result").getString("audio_url")
            } catch (e: Exception) {
                e.printStackTrace()
                Log.e("jsonResponse55",e.message.toString())
                "$$$$"
            }
        }
    }
}